/*
*****************Copyright (c)*************************************
**      Hangzhou Xili Watthour Meter Manufacture Co., Ltd. 
**--------------file info--------------------------------------------
**name: Drv_Tmr.c
**Author: maji
**date: 
**description: c code for RN8213 的定时器模块驱动层程序
**note:  Driver code for GENERAL
**--------------------Version History -------------------------------------
** NO. Date         Ver      By         Description 
**==============================================================
** 1   2015-09-11   v01.00   sosomj     1. frist version                             
**
**==============================================================
*/

#include "..\..\S6_MyIncludes\MyIncludes_H.h"



/*******************************************************************************************
** 函数名称: Init_Timer
** 函数描述: 初始化TIMER
** 输入参数: 无
** 输出参数: 无 
*******************************************************************************************/
void Drv_Timer_Init(void)
{
   TMOD=Bin(00010001);                   //T0 T1配置为16位定时器//
   TCON=TCON&Bin(00001111);              //清TF0 TR0 TF1 TR1//
   TCON1=Bin(00000000);                  //T1采用系统时钟1/12 做为时钟源   T0采用系统时钟1/12做为时钟源//
   TL0=LOBYTE(T0_10MS_CNT);
   TH0=HIBYTE(T0_10MS_CNT);
   TR0 = 1;		    //T0起动//				    
   ET0 = 1 ;                       
   
   T2CON=Bin(00110000);                 //T2做UART0的收发波特率发生器//
   T2MOD=Bin(10000000);                 //选择系统时钟做为T2的时钟源//
   TL2=LOBYTE(UART_BAUDRATE_300);
   TH2=HIBYTE(UART_BAUDRATE_300);
   RCAP2L=LOBYTE(UART_BAUDRATE_300);
   RCAP2H=HIBYTE(UART_BAUDRATE_300);
   TR2=1;                               //T2起动//
}

/*******************************************************************************************
** 函数名称: Start_Timer1
** 函数描述: 起动Time1
** 输入参数: 无
** 输出参数: 无 
*******************************************************************************************/
void Drv_Timer1_Start(void)
{
   TL1=LOBYTE(T1_80MS_CNT);
   TH1=HIBYTE(T1_80MS_CNT);
   TR1=1;
   ET1=1;
}

/*******************************************************************************************
** 函数名称: Start_Timer1
** 函数描述: 起动Time1
** 输入参数: 无
** 输出参数: 无 
*******************************************************************************************/
void Drv_Timer1_Stop(void)
{
   TL1=LOBYTE(T1_80MS_CNT);
   TH1=HIBYTE(T1_80MS_CNT);
   TR1=0;
   ET1=0;
}

/***************************************************************
*    END
****************************************************************/

