/*
*****************Copyright (c)*************************************
**      Hangzhou Xili Watthour Meter Manufacture Co., Ltd. 
**--------------file info--------------------------------------------
**name: mcu_H.H
**Author: maji
**date: 
**description:  define for mcu-496  function
**note: memer type  SD03A
**--------------------Version History -------------------------------------
** NO.	Date        		Ver    		By     			Description 
**==============================================================
** 1		2014-05-22  		0.1  			sosomj   			1. frist version                             
**
**==============================================================
*/


#ifndef _Mcu_H
#define _Mcu_H

/***********************************************************
*     声明文件引用
************************************************************/
#include "Drv_GPIO_H.h"
#include "Drv_clock_H.h"
#include "Drv_Tmr_H.h"
#include "Drv_Uart_H.h"



#endif
/***************************************************************
*    END
****************************************************************/

