/*
*****************Copyright (c)*************************************
**      Hangzhou Xili Watthour Meter Manufacture Co., Ltd. 
**--------------file info--------------------------------------------
**name: Lnk_Int.c
**Author: maji
**date: 
**description: c code for system interrupt module 
**note: memer type  "G80F903A_LSD4RF_2F717N01"
**--------------------Version History -------------------------------------
** NO. Date         Ver      By         Description 
**==============================================================
** 1   2016-03-21   v01.00   sosomj     1. frist version                             
**
**==============================================================
*/

#include <MyIncludes_H.h>


/*******************************************************************************************
** 函数名称: INT0_ISP
** 函数描述: 外部中断0中断服务程序
** 输入参数: 无
** 输出参数: 无 
*******************************************************************************************/
void INT0_ISP(void) interrupt 0
{
//   EA	=	0;
   IE0	=	0;
   //在此加入您要处理的代码   
//   EA	=	1;
}

/*******************************************************************************************
** 函数名称: Timer0_ISP
** 函数描述: T0中断服务程序10ms
** 输入参数: 无
** 输出参数: 无 
*******************************************************************************************/
void Timer0_ISP(void) interrupt 1
{	 
 //  EA=0;
   TF0=0;
   TL0=LOBYTE(T0_10MS_CNT);
   TH0=HIBYTE(T0_10MS_CNT);
   //在此加入您要处理的代码//
    gs_sys_run.font_fg |=  BIT0_FONT_FG_10MS;   
    if(gs_uart_iec_app_var.tx_delay_flg ==TRUE )
    {
        if(gs_uart_iec_app_var.tx_ready_10ms>0)  gs_uart_iec_app_var.tx_ready_10ms --;
    }

	if(gs_sys_run.font_fg &BIT1_FONT_P17_500MS)
    {
	 gs_sys_run.ms_500cnt++;
	 if(gs_sys_run.ms_500cnt>50)
	 {
       LOAR_DIO0_LOW();//
       gs_sys_run.ms_500cnt=0;
       gs_sys_run.font_fg &=~BIT1_FONT_P17_500MS;
	 }
	}

//   EA=1;
}

/*******************************************************************************************
** 函数名称: INT1_ISP
** 函数描述: 外部中断1中断服务程序
** 输入参数: 无
** 输出参数: 无 
*******************************************************************************************/
void INT1_ISP(void) interrupt 2
{ 
//   EA =0;
   //在此加入您要处理的代码    
   IE1=0;
//   EA	=	1;
}

/*******************************************************************************************
** 函数名称: Timer1_ISP
** 函数描述: T1中断服务程序
** 输入参数: 无
** 输出参数: 无 
*******************************************************************************************/
void Timer1_ISP(void) interrupt 3
{	                            
   TL1=LOBYTE(T1_80MS_CNT);
   TH1=HIBYTE(T1_80MS_CNT);
   TF1=0;
   //在此加入您要处理的代码 

}

/*******************************************************************************************
** 函数名称: EUART_ISP
** 函数描述: 串口中断服务程序
** 输入参数: 无
** 输出参数: 无 
*******************************************************************************************/
void EUART_ISP(void) interrupt 4
{             
   uint8 buf;
   EA=0;

   ////////////////////   TX   handle  ///////////////////////////////////////////
   if(TI)				                                            //发送中断?		//
   {
      //在此加入您要处理发送的代码//
      TI=0x00;	     

    /* transmit data complete irq */

        if (gs_uart_drv_var.tx_len>0)
        {
            buf=(gs_uart_drv_var.tx_buff[gs_uart_drv_var.tx_buff_index]);
            if(gs_uart_drv_var.bits_len==7)
           {
                 // 8位数据处理方式 无校验//
                 ACC=(buf &0xFF);
//                if(P)
//                {
//                    buf |= BIT7;
//                }
//                else
//                {
//                    buf&= ~BIT7;
//                }
            }
            else 
            {
                 // 8位数据处理方式 //
                 ACC=(buf);
                 TB8=P;
            }
            SBUF = buf;
            gs_uart_drv_var.tx_buff[gs_uart_drv_var.tx_buff_index] =0;
            gs_uart_drv_var.tx_buff_index++;
            gs_uart_drv_var.tx_len-- ;
        }
        else
        {
            //发送完成  //
            gs_uart_drv_var.tx_buff_index = 0;
            REN=1;     // 开启接收中断 //            
        }
    }

   ////////////////////   RX   handle  ///////////////////////////////////////////    
   if(RI)                                                //接收中断//
   {
          //在此加入您要处理接收的代码//
        RI=	0x00;  
        buf = SBUF;
        gs_uart_drv_var.rx_buff[gs_uart_drv_var.rx_buff_index] = buf;//  8位数据位//
        gs_uart_drv_var.rx_buff_index++;//BUFF下标
        gs_uart_drv_var.rx_len++;    //接收长度
		gs_uart_drv_var.rx_time=0;   //数据有接收 清接收定时器
        gs_uart_drv_var.rx_buff_index %= (UART_BUFF_SIZE); //0-249
   }
   EA=1;	  
}	 

/*******************************************************************************************
** 函数名称: Timer2_ISP
** 函数描述: TIMER2中断服务程序
** 输入参数: 无
** 输出参数: 无 
*******************************************************************************************/
void Timer2_ISP(void) interrupt 5
{	 
   EA=0;
   TF2=0;
   //在此加入您要处理的代码
   EA=1;
}

/*******************************************************************************************
** 函数名称: ADC_ISP
** 函数描述: ADC中断服务程序
** 输入参数: 无
** 输出参数: 无 
*******************************************************************************************/
void ADC_ISP(void) interrupt 6
{	 
   EA=0;
//   ADCIF=0;
   //在此加入您要处理的代码
   EA=1;
}

/*******************************************************************************************
** 函数名称: INT2_ISP
** 函数描述: 外部中断2中断服务程序
** 输入参数: 无
** 输出参数: 无 
*******************************************************************************************/
void INT2_ISP(void) interrupt 9
{
   EA	=	0;	  
   IE2	=	0;
   //在此加入您要处理的代码
   EA	=	1;
}

/*******************************************************************************************
** 函数名称: EUART1_ISP
** 函数描述: 串口1中断服务程序
** 输入参数: 无
** 输出参数: 无 
*******************************************************************************************/
void EUART1_ISP(void) interrupt 10
{


   if(SCON1&0x02)		//发送中断		  
   {
      SCON1 &=~0x02;   		  
      //在此加入您要处理发送的代码
   }		  
   if(SCON1&0x01)		//接收中断
   {
      SCON1 &=~0x01;   		
      //在此加入您要处理接收的代码
   }//End of if(RI)
}


/*******************************************************************************************
** 函数名称: SCM_ISP
** 函数描述: SCM中断服务程序
** 输入参数: 无
** 输出参数: 无 
*******************************************************************************************/
void SCM_ISP(void) interrupt 11
{
   EA	=	0;
//   SCMIF=	0;
   //在此加入您要处理的代码
   EA	=	1;
}

/*******************************************************************************************
** 函数名称: PWM_ISP
** 函数描述: PWM中断服务程序
** 输入参数: 无
** 输出参数: 无 
*******************************************************************************************/
void PWM_ISP(void) interrupt 12
{	 
   EA=0;
//   PWMIF=0;
   //在此加入您要处理的代码
   EA=1;
}  

/*******************************************************************************************
** 函数名称: LPD_ISP
** 函数描述: LPD中断服务程序
** 输入参数: 无
** 输出参数: 无 
*******************************************************************************************/
void LPD_ISP(void) interrupt 14
{	 
   uint16 i;
//   EA=0;
   //在此加入您要处理的代码
   for(i=0; i<100; i++)
	{
	   if( (LPDCON & Bin(01000000)) == Bin(00000000) ) break;
   }	
	if( i==100 ) //掉电
	{
   }
   LPDCON&=Bin(10111111);
}  






/***************************************************************
*    END
****************************************************************/

